Improve ADPLL architectural block diagrams
